app/views/static_pages/alltrails.html.erb

SELECT "trails".* FROM "trails"
---
    <tbody>
      <%= content_tag_for(:tr, Trail.all) do |trail| %>