app/controllers/trails_controller.rb

  def index
    @trails = current_user.trails.order(created_at: :desc)
---
SELECT "trails".* FROM "trails" WHERE "trails"."user_id" = $1  ORDER BY "trails"."created_at" DESC  [["user_id", 1]]

  def create
    @trail = Trail.new(trail_params)
    @trail.user = current_user

    respond_to do |format|
      if @trail.save
---
INSERT INTO "trails" ("name", "campsite", "water_source", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Neals Gap"], ["campsite", 2.5], ["water_source", "t"], ["user_id", 1], ["created_at", "2015-09-17 15:07:37.731955"], ["updated_at", "2015-09-17 15:07:37.731955"]]

  def update
    respond_to do |format|
      if @trail.update(trail_params)
---
UPDATE "trails" SET "water_source" = $1, "updated_at" = $2 WHERE "trails"."id" = $3  [["water_source", "f"], ["updated_at", "2015-09-17 15:23:26.455156"], ["id", 2]]

  def destroy
    @trail.destroy
---
DELETE FROM "trails" WHERE "trails"."id" = $1  [["id", 1]]

    def set_trail
      @trail = Trail.find(params[:id])
---
SELECT  "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT 1  [["id", 2]]